[
  {   
    "article_id": "1",
    "title": "Attack on Titan Ending?",
    "image": "https://link.com/image.jpg",
    "summary": "Apakah ending AOT memuaskan?",
    "content": "Studio Ghibli, yang didirikan bersama oleh Hayao Miyazaki dan Isao Takahata, telah menghasilkan beberapa film animasi paling dicintai dalam sejarah. Perpaduan unik mereka antara penceritaan yang fantastis, tema ekologis, dan protagonis wanita yang kuat membuat mereka berbeda. Film-film seperti 'Spirited Away,' 'My Neighbor Totoro,' dan 'Princess Mononoke' tidak hanya menakjubkan secara visual tetapi juga sangat menyentuh, menyentuh pengalaman manusia universal dan masalah lingkungan. Komitmen studio terhadap teknik animasi tradisional memberikan karya mereka nuansa buatan tangan yang khas yang sangat kontras dengan sebagian besar animasi CGI modern. Dedikasi terhadap kerajinan ini, dikombinasikan dengan narasi yang menarik, memastikan daya tarik abadi mereka lintas generasi."
  },
  {
    "article_id": "2",
    "title": "Kebangkitan Isekai: Mengapa Begitu Populer?",
    "image": "https://example.com/images/isekai_collage.jpg",
    "summary": "Analisis kebangkitan meteorik genre isekai dalam anime dan daya tariknya bagi audiens modern yang mencari pelarian.",
    "content": "Genre isekai, yang dicirikan oleh protagonis yang dipindahkan ke dunia lain, telah mendominasi lanskap anime dalam beberapa tahun terakhir. Dari 'Sword Art Online' hingga 'Re:Zero,' kisah-kisah ini menawarkan kepada pemirsa perpaduan unik antara petualangan, pemenuhan keinginan, dan seringkali, situasi komedi. Daya tariknya terletak pada fantasi memulai hidup baru di dunia baru, seringkali dengan kemampuan yang terlalu kuat, memungkinkan eksplorasi dinamika kekuatan dan struktur masyarakat yang berbeda. Meskipun beberapa mengkritik kejenuhannya, genre ini terus berkembang, menggabungkan latar dan arketipe karakter yang beragam, menunjukkan kemampuan adaptasinya dan popularitasnya yang abadi di kalangan demografi luas yang mencari pelarian dan narasi yang menarik."
  },
  {
    "article_id": "3",
    "title": "Memahami Genre Mecha: Lebih dari Sekadar Robot Raksasa",
    "image": "https://example.com/images/mecha_collage.jpg",
    "summary": "Menyelami kompleksitas genre mecha, menjelajahi evolusinya dari pertempuran robot sederhana menjadi narasi filosofis yang mendalam.",
    "content": "Genre mecha sering disamakan dengan robot raksasa yang bertarung dalam pertempuran spektakuler, tetapi kedalamannya melampaui tontonan belaka. Serial seperti 'Mobile Suit Gundam' merevolusi genre dengan memperkenalkan peperangan realistis dan ambiguitas moral, sementara 'Neon Genesis Evangelion' menggali trauma psikologis dan eksistensialisme. Anime mecha sering mengeksplorasi tema hubungan manusia dengan teknologi, kengerian perang, dan pencarian identitas. Evolusi genre ini menunjukkan kapasitasnya untuk penceritaan yang beragam, dari petualangan ringan hingga drama introspektif yang gelap, membuktikan relevansinya yang abadi di dunia anime dan kemampuannya untuk terus menemukan kembali dirinya."
  },
  {
    "article_id": "4",
    "title": "TEST",
    "image": "https://example.com/images/mecha_collage.jpg",
    "summary": "Menyelami kompleksitas genre mecha, menjelajahi evolusinya dari pertempuran robot sederhana menjadi narasi filosofis yang mendalam.",
    "content": "Genre mecha sering disamakan dengan robot raksasa yang bertarung dalam pertempuran spektakuler, tetapi kedalamannya melampaui tontonan belaka. Serial seperti 'Mobile Suit Gundam' merevolusi genre dengan memperkenalkan peperangan realistis dan ambiguitas moral, sementara 'Neon Genesis Evangelion' menggali trauma psikologis dan eksistensialisme. Anime mecha sering mengeksplorasi tema hubungan manusia dengan teknologi, kengerian perang, dan pencarian identitas. Evolusi genre ini menunjukkan kapasitasnya untuk penceritaan yang beragam, dari petualangan ringan hingga drama introspektif yang gelap, membuktikan relevansinya yang abadi di dunia anime dan kemampuannya untuk terus menemukan kembali dirinya."
  }
]
